In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
#Drop entry
testing = Series(np.arange(5), index = ['A', 'B', 'C', 'D', 'E'])
testing

A    0
B    1
C    2
D    3
E    4
dtype: int32

In [6]:
testing.drop('C')                                      #Doesn't permanently affect array

A    0
B    1
C    2
D    3
dtype: int32

In [7]:
dframe_ex = DataFrame(np.arange(9).reshape((3, 3)), index = ['DUB', 'BER', 'LDN'], columns = ['One', 'Two', 'Three'])
dframe_ex

     One  Two  Three
DUB    0    1      2
BER    3    4      5
LDN    6    7      8

In [10]:
save = dframe_ex.drop('DUB')
save

     One  Two  Three
BER    3    4      5
LDN    6    7      8

In [11]:
dframe_ex

     One  Two  Three
DUB    0    1      2
BER    3    4      5
LDN    6    7      8

In [12]:
dframe_ex.drop('Two', axis = 1)

     One  Three
DUB    0      2
BER    3      5
LDN    6      8

In [16]:
dframe_ex.drop('DUB', axis = 0 )

     One  Two  Three
BER    3    4      5
LDN    6    7      8

In [17]:
#Sorting values
type_ser = Series(np.arange(3), ['A', 'B', 'C'])
type_ser = 2 * type_ser
type_ser

A    0
B    2
C    4
dtype: int32

In [18]:
type_ser['C']

4

In [21]:
type_ser[2]                                      #Same as 'type_ser['C']'

4

In [24]:
type_ser[:4]

A    0
B    2
C    4
dtype: int32

In [25]:
type_ser[['B', 'A']]

B    2
A    0
dtype: int32

In [26]:
type_ser[type_ser > 1]                         #Boolean logic can be implemented

B    2
C    4
dtype: int32

In [27]:
type_ser[type_ser > 1] = 5                     #If a certain condition is met, a specific value can be assigned
type_ser

A    0
B    5
C    5
dtype: int32

In [33]:
#DataFrames
test_frame =  DataFrame(np.arange(49).reshape((7,7)), index = ['First', 'Second', 'Third', 'Fourth', 'Fifth', 'Sixth', 'Seventh'],
                       columns = ['A', 'B', 'C', 'D', 'E', 'F', 'G'])
test_frame

          A   B   C   D   E   F   G
First     0   1   2   3   4   5   6
Second    7   8   9  10  11  12  13
Third    14  15  16  17  18  19  20
Fourth   21  22  23  24  25  26  27
Fifth    28  29  30  31  32  33  34
Sixth    35  36  37  38  39  40  41
Seventh  42  43  44  45  46  47  48

In [34]:
test_frame['C']

First       2
Second      9
Third      16
Fourth     23
Fifth      30
Sixth      37
Seventh    44
Name: C, dtype: int32

In [38]:
test_frame[['E', 'A', 'D']]

          E   A   D
First     4   0   3
Second   11   7  10
Third    18  14  17
Fourth   25  21  24
Fifth    32  28  31
Sixth    39  35  38
Seventh  46  42  45

In [43]:
test_frame[test_frame['B'] > 10]

          A   B   C   D   E   F   G
Third    14  15  16  17  18  19  20
Fourth   21  22  23  24  25  26  27
Fifth    28  29  30  31  32  33  34
Sixth    35  36  37  38  39  40  41
Seventh  42  43  44  45  46  47  48

In [44]:
test_frame

          A   B   C   D   E   F   G
First     0   1   2   3   4   5   6
Second    7   8   9  10  11  12  13
Third    14  15  16  17  18  19  20
Fourth   21  22  23  24  25  26  27
Fifth    28  29  30  31  32  33  34
Sixth    35  36  37  38  39  40  41
Seventh  42  43  44  45  46  47  48

In [45]:
test_frame > 15

             A      B      C      D      E      F      G
First    False  False  False  False  False  False  False
Second   False  False  False  False  False  False  False
Third    False  False   True   True   True   True   True
Fourth    True   True   True   True   True   True   True
Fifth     True   True   True   True   True   True   True
Sixth     True   True   True   True   True   True   True
Seventh   True   True   True   True   True   True   True

In [46]:
test_frame.loc['Third']

A    14
B    15
C    16
D    17
E    18
F    19
G    20
Name: Third, dtype: int32

In [48]:
test_frame.iloc[1]

A     7
B     8
C     9
D    10
E    11
F    12
G    13
Name: Second, dtype: int32

In [49]:
#Data alignment
ser = Series([2, 3, 4], index = ['X', 'Y', 'Z'])
ser

X    2
Y    3
Z    4
dtype: int64

In [50]:
ser2 = Series([5, 6, 7, 8], index = ['X', 'Y', 'Z', 'W'])
ser2

X    5
Y    6
Z    7
W    8
dtype: int64

In [51]:
ser + ser2                                                  #Only adds up values where index is a match -> Otherwise null value

W     NaN
X     7.0
Y     9.0
Z    11.0
dtype: float64

In [55]:
df = DataFrame(np.arange(4).reshape((2, 2)), columns = list('XY'),
              index = ['BER', 'DUB']) 
#'List' creates a column out of 'XY'
df

     X  Y
BER  0  1
DUB  2  3

In [69]:
df2 = DataFrame(np.arange(9).reshape((3, 3)), columns = list('XBC'),index = ['DUB', 'BER', 'WDC']) #Must be same index as above
df2

     X  B  C
DUB  0  1  2
BER  3  4  5
WDC  6  7  8

In [70]:
df + df2

      B   C    X   Y
BER NaN NaN  3.0 NaN
DUB NaN NaN  2.0 NaN
WDC NaN NaN  NaN NaN

In [71]:
df

     X  Y
BER  0  1
DUB  2  3

In [74]:
df.add(df2, fill_value = 0)                        #Adds 'df' & 'df2' and replaces null values with '0'

       B    C    X    Y
BER  4.0  5.0  3.0  1.0
DUB  1.0  2.0  2.0  3.0
WDC  7.0  8.0  6.0  NaN

In [ ]:
#SEE 'PANDAS - ENTRIES #2' FOR COMPLETION OF EXAMPLE